/* package up error # */
"error %1$d" = "fel %1$d";
"error %1$#x" = "fel %1$#x";
/* errno error 0 */
"Unknown error: 0" = "Okänt fel: 0";

/* errno error 1 */
"Operation not permitted" = "Åtgärden är inte tillåten";

/* errno error 2 */
"No such file or directory" = "Det finns ingen sådan fil eller katalog";

/* errno error 3 */
"No such process" = "Det finns ingen sådan process";

/* errno error 4 */
"Interrupted system call" = "Avbrutet systemanrop";

/* errno error 5 */
"Input/output error" = "In-/utmatningsfel";

/* errno error 6 */
"Device not configured" = "Enheten är inte inställd";

/* errno error 7 */
"Argument list too long" = "Argumentlistan är för lång";

/* errno error 8 */
"Exec format error" = "Formatfel för program";

/* errno error 9 */
"Bad file descriptor" = "Felaktig filbeskrivning";

/* errno error 10 */
"No child processes" = "Inga underordnade processer";

/* errno error 11 */
"Resource deadlock avoided" = "Resursdödläge har undvikits";

/* errno error 12 */
"Cannot allocate memory" = "Kan inte tilldela minne";

/* errno error 13 */
"Permission denied" = "Behörighet gavs inte";

/* errno error 14 */
"Bad address" = "Felaktig adress";

/* errno error 15 */
"Block device required" = "Blockindelad enhet krävs";

/* errno error 16 */
"Resource busy" = "Resursen upptagen";

/* errno error 17 */
"File exists" = "Filen finns redan";

/* errno error 18 */
"Cross-device link" = "Länk mellan enheter";

/* errno error 19 */
"Operation not supported by device" = "Åtgärden stöds inte av enheten";

/* errno error 20 */
"Not a directory" = "Är inte en katalog";

/* errno error 21 */
"Is a directory" = "Är en katalog";

/* errno error 22 */
"Invalid argument" = "Ogiltigt argument";

/* errno error 23 */
"Too many open files in system" = "För många öppna filer i systemet";

/* errno error 24 */
"Too many open files" = "För många öppna filer";

/* errno error 25 */
"Inappropriate ioctl for device" = "Olämpligt ioctl för enhet";

/* errno error 26 */
"Text file busy" = "Textfilen är upptagen";

/* errno error 27 */
"File too large" = "Filen är för stor";

/* errno error 28 */
"No space left on device" = "Det finns inget utrymme kvar på enheten";

/* errno error 29 */
"Illegal seek" = "Ogiltig sökning";

/* errno error 30 */
"Read-only file system" = "Skrivskyddat filsystem";

/* errno error 31 */
"Too many links" = "För många länkar";

/* errno error 32 */
"Broken pipe" = "Brutet rör";

/* errno error 33 */
"Numerical argument out of domain" = "Felaktigt numeriskt argument";

/* errno error 34 */
"Result too large" = "Resultatet är för stort";

/* errno error 35 */
"Resource temporarily unavailable" = "Resursen är inte tillgänglig just nu";

/* errno error 36 */
"Operation now in progress" = "Åtgärden pågår nu";

/* errno error 37 */
"Operation already in progress" = "Åtgärden pågår redan";

/* errno error 38 */
"Socket operation on non-socket" = "Socketåtgärd försöktes på icke-socket";

/* errno error 39 */
"Destination address required" = "Måladress krävs";

/* errno error 40 */
"Message too long" = "Meddelandet är för långt";

/* errno error 41 */
"Protocol wrong type for socket" = "Fel protokolltyp för socket";

/* errno error 42 */
"Protocol not available" = "Protokollet är inte tillgängligt";

/* errno error 43 */
"Protocol not supported" = "Protokollet stöds inte";

/* errno error 44 */
"Socket type not supported" = "Sockettyp stöds inte";

/* errno error 45 */
"Operation not supported" = "Åtgärden stöds inte";

/* errno error 46 */
"Protocol family not supported" = "Protokollfamiljen stöds inte";

/* errno error 47 */
"Address family not supported by protocol family" = "Adressfamiljen stöds inte av protokollfamiljen";

/* errno error 48 */
"Address already in use" = "Adressen används redan";

/* errno error 49 */
"Can't assign requested address" = "Kan inte tilldela begärd adress";

/* errno error 50 */
"Network is down" = "Nätverket är nere";

/* errno error 51 */
"Network is unreachable" = "Nätverket kan inte nås";

/* errno error 52 */
"Network dropped connection on reset" = "Nätverksanslutningen förlorades vid återställning";

/* errno error 53 */
"Software caused connection abort" = "Program orsakade avbrott i anslutningen";

/* errno error 54 */
"Connection reset by peer" = "Anslutningen återställdes av annan dator";

/* errno error 55 */
"No buffer space available" = "Inget buffertutrymme är tillgängligt";

/* errno error 56 */
"Socket is already connected" = "Socket är redan ansluten";

/* errno error 57 */
"Socket is not connected" = "Socket är inte ansluten";

/* errno error 58 */
"Can't send after socket shutdown" = "Kan inte skicka efter att socket stängts";

/* errno error 59 */
"Too many references: can't splice" = "För många referenser - kan inte foga ihop";

/* errno error 60 */
"Operation timed out" = "Åtgärden uppnådde en maxtidsgräns";

/* errno error 61 */
"Connection refused" = "Anslutningen nekades";

/* errno error 62 */
"Too many levels of symbolic links" = "För många nivåer av symboliska länkar";

/* errno error 63 */
"File name too long" = "Filnamnet är för långt";

/* errno error 64 */
"Host is down" = "Värden är inte tillgänglig";

/* errno error 65 */
"No route to host" = "Ingen väg till värden";

/* errno error 66 */
"Directory not empty" = "Katalogen är inte tom";

/* errno error 67 */
"Too many processes" = "För många processer";

/* errno error 68 */
"Too many users" = "För många användare";

/* errno error 69 */
"Disc quota exceeded" = "Skivutrymmet överskreds";

/* errno error 70 */
"Stale NFS file handle" = "Inaktuell NFS-filhanterare";

/* errno error 71 */
"Too many levels of remote in path" = "För många fjärrnivåer i sökväg";

/* errno error 72 */
"RPC struct is bad" = "Felaktig RPC-struktur";

/* errno error 73 */
"RPC version wrong" = "Felaktig RPC-version";

/* errno error 74 */
"RPC prog. not avail" = "RPC-prog. ej tillg.";

/* errno error 75 */
"Program version wrong" = "Fel programversion";

/* errno error 76 */
"Bad procedure for program" = "Felaktig programprocedur";

/* errno error 77 */
"No locks available" = "Inga lås är tillgängliga";

/* errno error 78 */
"Function not implemented" = "Funktionen är inte införd";

/* errno error 79 */
"Inappropriate file type or format" = "Olämplig filtyp eller filformat";

/* errno error 80 */
"Authentication error" = "Autentiseringsfel";

/* errno error 81 */
"Need authenticator" = "Autentiserare krävs";

/* errno error 82 */
"Device power is off" = "Enheten är inte påslagen";

/* errno error 83 */
"Device error" = "Enhetsfel";

/* errno error 84 */
"Value too large to be stored in data type" = "Värdet är för stort för att lagras i datatypen";

/* errno error 85 */
"Bad executable (or shared library)" = "Felaktigt program (eller delat bibliotek)";

/* errno error 86 */
"Bad CPU type in executable" = "Felaktig processortyp i program";

/* errno error 87 */
"Shared library version mismatch" = "Version överensstämmer inte för delat bibliotek";

/* errno error 88 */
"Malformed Mach-o file" = "Fel format på Mach-o-fil";

/* errno error 89 */
"Operation canceled" = "Åtgärden avbröts";

/* errno error 90 */
"Identifier removed" = "Identifieraren togs bort";

/* errno error 91 */
"No message of desired type" = "Inget meddelande av önskad typ";

/* errno error 92 */
"Illegal byte sequence" = "Otillåten byte-sekvens";

/* errno error 93 */
"Attribute not found" = "Attributet hittades inte";

/* errno error 94 */
"Bad message" = "Felaktigt meddelande";

/* errno error 95 */
"EMULTIHOP (Reserved)" = "EMULTIHOP (reserverad)";

/* errno error 96 */
"No message available on STREAM" = "Inget meddelande tillgängligt på STREAM";

/* errno error 97 */
"ENOLINK (Reserved)" = "ENOLINK (reserverad)";

/* errno error 98 */
"No STREAM resources" = "Inga STREAM-resurser";

/* errno error 99 */
"Not a STREAM" = "Inte en STREAM";

/* errno error 100 */
"Protocol error" = "Protokollfel";

/* errno error 101 */
"STREAM ioctl timeout" = "Maxtidsgräns för STREAM passerad";

/* errno error 102 */
"Operation not supported on socket" = "Åtgärden saknar stöd på sockeln";

/* errno error 103 */
"Policy not found" = "Policyn hittades inte";
